app/reflexes/todo_item_reflex.rb

SELECT "todo_items".* FROM "todo_items" WHERE "todo_items"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
DELETE FROM "todo_items" WHERE "todo_items"."id" = ?  [["id", 11]]
---
  def delete_that_item
    todo_item = TodoItem.find(element.dataset.id)
    todo_item.destroy

SELECT "todo_items".* FROM "todo_items" WHERE "todo_items"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
UPDATE "todo_items" SET "completed" = ?, "completed_at" = ?, "updated_at" = ? WHERE "todo_items"."id" = ?  [["completed", 0], ["completed_at", nil], ["updated_at", "2021-04-16 15:10:12.629694"], ["id", 4]]
---
  def complete_positive
    todo_item = TodoItem.find(element.dataset.id)
    todo_item.update(completed: true, completed_at: Time.now)

SELECT "todo_items".* FROM "todo_items" WHERE "todo_items"."id" = ? LIMIT ?  [["id", 12], ["LIMIT", 1]]
UPDATE "todo_items" SET "completed" = ?, "completed_at" = ?, "updated_at" = ? WHERE "todo_items"."id" = ?  [["completed", 0], ["completed_at", nil], ["updated_at", "2021-04-20 19:49:55.246293"], ["id", 12]]
---
  def complete_negative
    todo_item = TodoItem.find(element.dataset.id)
    todo_item.update(completed: false, completed_at: nil)