app/reflexes/todo_list_reflex.rb

    def delete_that_list
      todo_list = TodoList.find(element.dataset.id)
      items = TodoItem.where(todo_list_id: todo_list)
      items.destroy_all && todo_list.destroy
---
SELECT "todo_lists".* FROM "todo_lists" WHERE "todo_lists"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
SELECT "todo_items".* FROM "todo_items" WHERE "todo_items"."todo_list_id" = ?  [["todo_list_id", 11]]
DELETE FROM "todo_items" WHERE "todo_items"."id" = ?  [["id", 1]]
DELETE FROM "todo_lists" WHERE "todo_lists"."id" = ?  [["id", 10]]