app/views/todo_lists/show.html.erb

SELECT "todo_items".* FROM "todo_items" WHERE "todo_items"."todo_list_id" = ?  [["todo_list_id", 1]]
---
  <ul class="list-group">
    <% @todo_list.todo_items.each do |todo_item| %>