app/controllers/todo_lists_controller.rb

INSERT INTO "todo_lists" ("title", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["title", "aa"], ["created_at", "2021-04-20 15:44:13.452031"], ["updated_at", "2021-04-20 15:44:13.452031"], ["user_id", 5]]
---
  def create
    @todo_list = TodoList.new(todo_list_params)

    respond_to do |format|
      if @todo_list.save

UPDATE "todo_lists" SET "updated_at" = ?, "user_id" = ? WHERE "todo_lists"."id" = ?  [["updated_at", "2021-04-18 13:08:29.915445"], ["user_id", 2], ["id", 1]]
---
  def update
    respond_to do |format|
      if @todo_list.update(todo_list_params)

SELECT "todo_lists".* FROM "todo_lists" WHERE "todo_lists"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
---
    def set_todo_list
      @todo_list = TodoList.find(params[:id])