app/controllers/todo_items_controller.rb

INSERT INTO "todo_items" ("task", "todo_list_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["task", "Some"], ["todo_list_id", 5], ["created_at", "2021-04-20 19:52:37.052777"], ["updated_at", "2021-04-20 19:52:37.052777"]]
---
  def create
    @todo_item = @todo_list.todo_items.build(todo_item_params)

    if @todo_item.save

UPDATE "todo_items" SET "task" = ?, "completed" = ?, "updated_at" = ? WHERE "todo_items"."id" = ?  [["task", "jjjkksadf"], ["completed", 0], ["updated_at", "2021-04-16 15:01:43.215738"], ["id", 5]]
---
  def update
    if @todo_item.update(todo_item_params)

DELETE FROM "todo_items" WHERE "todo_items"."id" = ?  [["id", 1]]
---
  def destroy
    @todo_item.destroy